// 13_flag.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
// 과제 할 때 자주 하는 실수를 가볍게 해설. 

#include <iostream>

int main()
{
    // 배열에서 있다, 없다 문제를 flag 변수로 해결할 수 있다.
    // 이때, count ++ 대신 , 해당 값이 있다면 flag ==1. 없다면 초기화값인 0 그대로.
    // 따라서 최종 조건으로 flag가 1인지, 아닌지로만 있/없을 구분할 수 있다. count++보다 더 간단한 방법! 
}


// 최대, 최소를 찾을때.

// 최소값을 찾을땐, 변수를 크게 최기화 한다. 
// if문의 조건은 min>arr[i] 로 잡을 것. 직접 해보면 알 수 있을듯. 



// 배열을 다른 배열로 복사할 때.

// 새로운 배열을 하나 만든 후, 새로운 배열의 인덱스도 변수를 만들어서 넣어준다.
// 그 배열[인덱스] 에 값을 대입해주며 복사하면 된다. 
